
"%d years ago" = "%dy ago";

"%d years later" = "%dy later";

"1 year ago" = "1y ago";

"1 year later" = "1y later";

"%d months ago" = "%dmo ago";

"%d months later" = "%dmo later";

"1 month ago" = "1mo ago";

"1 month later" = "1mo later";

"%d weeks ago" = "%dw ago";

"%d weeks later" = "%dw later";

"1 week ago" = "1w ago";

"1 week later" = "1w later";

"%d days ago" = "%dd ago";

"%d days later" = "%dd later";

"1 day ago" = "1d ago";

"1 day later" = "1d later";

"%d hours ago" = "%dh ago";

"%d hours later" = "%dh later";

"1 hour ago" = "1h ago";

"1 hour later" = "1h later";

"%d minutes ago" = "%dm ago";

"%d minutes later" = "%dm later";

"1 minute ago" = "1m ago";

"1 minute later" = "1m later";

"%d seconds ago" = "%ds ago";

"%d seconds later" = "%ds later";

"1 second ago" = "1s ago";

"1 second later" = "1s later";

"just now" = "just now";